Revit 2025 API
RebarBendData.BarModelDiameter Property
 Defines the model diameter of the bar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public double BarModelDiameter { get; set; }
Public Property BarModelDiameter As Double
	Get
	Set
public:
property double BarModelDiameter {
	double get ();
	void set (double value);
}
member BarModelDiameter : float with get, set
Property Value
Double
See Also
Reference
RebarBendData Class
Autodesk.Revit.DB.Structure Namespace